Revit 2027 API
Parameter.HasValue Property
Identifies if the parameter has an assigned value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValue { get; }
Public ReadOnly Property HasValue As Boolean
	Get
public:
property bool HasValue {
	bool get ();
}
member HasValue : bool with get
Property Value
Boolean
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace